Revit 2026 API

# AssetPropertyIsEditable Method

---

Check if property can be edited.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEditable()
```
```vb
Public Function IsEditable As Boolean
```
```cpp
public:
bool IsEditable()
```
```fsharp
member IsEditable : unit -> bool
```

#### Return Value

Boolean True if property is editable.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The asset property is not editable. Asset can be edited only in an edit scope. |

Properties can be edited only if there is an active Edit Scope and if the property is allowed to be changed.

#### Reference

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace